#
#                 << Метод "Прогонки" (Метод Томаса) >>
#
#
#   -11x1-9x2 = -122
#   5x1 - 15x2-2x3 = -48
#   -8x2 + 11x3 - 3x4 = 14
#   6x3 - 15x4+4x5 = -50
#   3x4 + 6x5 = 42
#
#   Эту систему можно выразить с помощью формулы
#
#   bi*x(i-1) + cixi + di*x(i+1) = ri
#   где b1 = 0, d5 = 0;
#
clear all;
n = 5

b = [ 0 5 -8 6 3]';
c = [-11 -15 11 -15 6]';
d = [-9 -2 -3 4 0]';
r = [-122 -48 14 -50 42]';

B(1) = -d(1)/c(1);
L(1) = r(1)/c(1);


for i=2:1:n
  B(i) = -d(i) / (b(i)*B(i-1) + c(i));
  L(i) = (r(i) - b(i)*L(i-1))/(b(i)*B(i-1) + c(i));
end

x(n) = L(n);
for i=(n-1):(-1):1
  x(i) = B(i)*x(i+1) + L(i);
end
