#                 Метод "Якоби"
#
#   29x1 + 8x2 + 9x3 - 9x4 = 197
#   -7x1 - 25x2 + 9x4      = -226
#   x1 + 6x2 + 16x3 -2x4 = -95
#   -7x1 + 4x2 - 2x3 + 17x4 = -58
#

# A = L + D + R

#L = (0 0 0 0; -7 0 0 0; 1 6 0 0; -7 4 -2 0);
#D = ( 23 0 0 0; 7 -15 0 0; 0 0 16 0; 0 0 0 17);
#R = (0 8 9 -9; 0 0 0 9; 0 0 0 -2; 0 0 0 0);

#AX = B
#(L+D+R) * X = B
#LX + DX + RX = B
# Dx = -(L+R)*X + B |* D^(-1)
# x = -D^(-1) * (L+R)* X + D^(-1) * B


# Ax^i приблизительно равно
# ср(|A*x^i - B| = eps)

# ==== BEGIN ====
clear all;

n=4;
B = [197 -226 -95 -58]';

A = [29 8 9 -9;
     -7 -25 0 9;
     1 6 16 -2;
     -7 4 -2 17];

# X = -D^(-1)*(L+R)* X + D^(-1)*B;

# a11x1 + a12x2+ a13x3+a14x4 = b1
# a21x1 + a22x2 + a23x3 + a24x4 = b2;
# a31x1 + a32x2 + a33x3 + a34x4 = b3;
# a41x1 + a42x2 + a43x3 + a44x4 = b4;

# Выражаем иксы с множителем
# a11x1 = -(a12x2 + 13x3+ a14x4) + b1
# a22x2 = -(a21x1 + a23x3 + a24x4) + b2
# a33x1 = -(a31x1 + a32x2 + a34x4) + b3
# a44x4 = - (a41x1 + a42x2 + a43x3) + b4

# Выводим иксы деля на множитель справа...
# x1 = -(1/a11)(a12x2 + a13x3+ a14x4) +(b1/a11)
# x2 = -(1/a22)(a12x1 + a13x3+ a14x4) +(b1/a22)
# x3 = -(1/a33)(a12x1 + a13x2+ a14x4) +(b1/a33)
# x4 = -(1/a44)(a12x1 + a13x2+ a14x3) +(b1/a44)

X = [1 1 1 1]';
X0 = X;

for k = 1: 1: 100
  for i = 1: 1: n
    sum = 0;
    for j = 1: 1: (n-1)
      sum = sum + A(i, j) * X0(j);
    endfor

    for j = (i+1): 1: n
      sum = sum + A(i, j) * X0(j);
    endfor

    X(i) = -sum / A(i, i) + B(i)/A(i,i);
  endfor
  X0 = X;
  [k mean(abs(A*X - B))]
endfor
