#             Метод Гауса-Зейделя

clear all;


n=4;
B = [197 -226 -95 -58]';

A = [29 8 9 -9;
     -7 -25 0 9;
     1 6 16 -2;
     -7 4 -2 17];

# x1^5, x2^5, x3^5, x4^5

# x1 = -(1/a11)(a12x2 + a13x3+ a14x4) +(b1/a11)
# x2 = -(1/a22)(a12x1 + a13x3+ a14x4) +(b1/a22)
# x3 = -(1/a33)(a12x1 + a13x2+ a14x4) +(b1/a33)
# x4 = -(1/a44)(a12x1 + a13x2+ a14x3) +(b1/a44)

# x1^6 = -(1/a11)(a12(x2^5) + a13(x3^5) + a14(x4^5)) +(b1/a11)
# x2^6 = -(1/a22)(a12(x1^6) + a13(x3^5) + a14(x4^5)) +(b1/a22)
# x3^6 = -(1/a33)(a12(x1^6) + a13(x2^6) + a14(x4^5)) +(b1/a33)
# x4^6 = -(1/a44)(a12(x1^6) + a13(x2^6) + a14(x3^6)) +(b1/a44)

X = [1 1 1 1]';
X0 = X;

for k = 1: 1: 100
  for i = 1: 1: n
    sum = 0;
    for j = 1: 1: (n-1)
      sum = sum + A(i, j) * X(j);
    endfor

    for j = (i+1): 1: n
      sum = sum + A(i, j) * X0(j);
    endfor

    X(i) = -sum / A(i, i) + B(i)/A(i,i);
  endfor
  X0 = X;
  [k mean(abs(A*X - B))]
endfor
